import React from "react"

export default function Main(){
    return (
        <div>
            <div className="upper-part1">
                <h2>
                    <span style={{color: '#FAA111'}}>Є</span>вропейська<br/>
                    <span style={{color: '#FAA111'}}>Н</span>орма<br/>
                    <span style={{color: '#FAA111'}}>О</span>селі для<br/>
                    <span style={{color: '#FAA111'}}>Т</span>ебе</h2>
                <h3><br/>Вітаємо вас у світі нерухомості, <br/> де ваші мрії стають реальністю!</h3>
            </div>
            <div className='upper-part2'>
                <h3>Наша агенція нерухомості в Києві - ваш надійний <br/> партнер у всіх питаннях,
                    повєязаних з купівлею, продажем <br/> чи арендою нерухомості.</h3>
            </div>
            <div className='middle-part-connector'>
                <h1>
                <span style={{color: '#FAA111'}}>ПРОДАЖ. КУПІВЛЯ.</span>
                    <span style={{color: 'white'}}>АРЕНДА.<br/> КОНСТУЛЬТАЦІЇ РІЄЛТОРА КИЇВ</span></h1>
            </div>
            <div className='middle-part1'>
                <div className='middle-part1-left'>
                    <h3>Експертна команда:</h3>
                    <img src={require('../images/expteam.png' )} alt='expteam.png' />
                    <h4>Наша агенція має<br/> команду досвідчених<br/> та кваліфікованих фахівців<br/> у галузі
                        нерухомості.</h4>
                </div>
                <div className='middle-part1-center'>
                    <h3>Повний спектр послуг:</h3>
                    <img src={require('../images/fulserv.png' )} alt='fulserv.png' />
                    <h4>Ми пропонуємо повний<br/> спектр послуг у сфері<br/> нерухомості, включаючи покупку,
                        продаж та інше.</h4>
                </div>
                <div className='middle-part1-right'>
                    <h3>Індивідуальний підхід:</h3>
                    <img src={require('../images/pers.png' )} alt='pers.png' />
                    <h4>Ми пропонуємо<br/> персоналізований підхід<br/> до кожного клієнта,<br/> враховуючи їх
                        унікальні<br/> потреби та бажання.</h4>
                </div>
            </div>
            <div className='form'>
                <div className='forminput'>
                    <input/><button>Консультація</button>
                    <h3><br/>Або зателефонуйте нам +38 (093) 962 08 67</h3>
                </div>
            </div>
            <div>
                <div className='middle-part-connector2'>
                    <h3>
                        Ваш успіх - наша мета. Ми вкладаємо всі зусилля в те,<br/> щоб забезпечити ваш успіх у пошуку нерухомості.
                    </h3>
                </div>
            </div>
            <div className="middle-part2">
                <div className="middle-part2-top">
                    <h2>Про нас:</h2>
                    <h3>Ми маємо доступ до широкого асортименту нерухомості та
                        ринкової інформації. Це означає,<br/> що ми можемо швидко знайти відповідні варіанти, які
                        потребам та бажанням, що економить вам час на пошуки. Попередній відбір об'єктів:<br/> Ми проводимо попередній відбір нерухомості, що відповідає
                        вашим критеріям. Це допомагає уникнути марно витраченого часу на перегляд об'єктів,
                        які не відповідають вашим потребам. Попередній відбір об'єктів: Ми проводимо попередній відбір нерухомості, що відповідає
                        вашим критеріям. Це допомагає уникнути марно витраченого часу на перегляд об'єктів,
                        які не відповідають вашим потребам. и маємо доступ до широкого асортименту нерухомості та
                        ринкової інформації. Це означає,<br/> що ми можемо швидко знайти відповідні варіанти, які
                        потребам та бажанням, що економить вам час на пошуки. Попередній відбір об'єктів:<br/> Ми проводимо попередній відбір нерухомості, що відповідає
                        вашим критеріям.
                    </h3>
                </div>
                <div className="middle-part2-bottom">
                    <h2>Чому варто обрати нас?</h2>
                    <h3> Ми допомагаємо клієнтам зекономити час, шукаючи найкращі пропозиції та виконуючи всі
                        необхідні формальності.
                    </h3>
                    <ul>
                        <li>
                            Експертиза та досвід:<br/> Наша професійна команда має глибокі знання про ринок нерухомості
                            та
                            всі процеси, пов'язані з покупкою чи продажем.
                            Ми забезпечуємо швидку та ефективну навігацію в усіх аспектах угоди.
                        </li>
                        <li>
                            Попередній відбір об'єктів:<br/> Ми проводимо попередній відбір нерухомості, що відповідає
                            вашим критеріям. Це допомагає уникнути марно витраченого часу на перегляд об'єктів,
                            які не відповідають вашим потребам.
                        </li>
                        <li>
                            Усунення бюрократії:<br/> Наша команда бере на себе усі формальності, пов'язані з покупкою чи
                            продажем нерухомості, включаючи підготовку документів, перевірку юридичних аспектів та
                            багато іншого. Це значно спрощує процес і зберігає ваш час.
                        </li>
                        <li>
                            Прискорені угоди:<br/> З нашою підтримкою угоди можуть бути укладені швидше, оскільки ми вже
                            маємо досвід у роботі з усіма сторонами угоди та
                            як вирішувати можливі труднощі, що можуть затримати угоду.
                        </li>
                    </ul>
                </div>
            </div>
        </div>
    )
}

